app/controllers/items_controller.rb

  def index
    @items = Item.all.page params[:page]
---
SELECT  "items".* FROM "items" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "items"

  def create
    #render plain: params[:items].inspect
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("title", "text", "trainimage_file_name", "trainimage_content_type", "trainimage_file_size", "trainimage_fingerprint", "trainimage_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @item = Item.find(params[:id])

    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "items" SET "trainimage_file_name" = ?, "trainimage_content_type" = ?, "trainimage_file_size" = ?, "trainimage_fingerprint" = ?, "trainimage_updated_at" = ?, "updated_at" = ? WHERE "items"."id" = ?